css.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Cascading StyleSheets</title>
<link rel="stylesheet" href="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
nil
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Cascading StyleSheets</h1><p class="date">Created: 2016-12-30 Fri 23:08</p>
</section>


<section>
<section id="slide-org3237f75" data-background="./images/web-development.jpg" data-background-size="700px" data-background-transition="slide">
<h2 id="org3237f75"></h2>

</section>
</section>
<section>
<section id="slide-org33767eb">
<h2 id="org33767eb">What is CSS?</h2>
<blockquote nil>
<p>
Cascading Style Sheets is a style sheet language developed to control the presentation of markup language documents.
</p>
</blockquote>

<p>
CSS deals with the presentation while HTML deals with structure of the web.
</p>

</section>
</section>
<section>
<section id="slide-org47fcb3a">
<h2 id="org47fcb3a">What is CSS?</h2>
<ul>
<li><p>
A style sheet is a set of rule defining how an html element will be "presented" in the browser.
</p>
<blockquote nil>
<p>
These rules are targeted to specific element in the html document.
</p>
</blockquote></li>

</ul>

</section>
</section>
<section>
<section id="slide-org299c386" data-background="./images/cssvshtml.jpg" data-background-size="700px" data-background-transition="slide">
<h2 id="org299c386"></h2>


</section>
</section>
<section>
<section id="slide-orgc4b5816" data-background="./images/diff.jpg" data-background-size="600px" data-background-transition="slide">
<h2 id="orgc4b5816"></h2>

</section>
</section>
<section>
<section id="slide-orgecc805a">
<h2 id="orgecc805a">CSS</h2>
<ul>
<li>Style Sheets are a collection of formatting rules</li>
<li>Styles are mostly contained in an external file</li>

</ul>

</section>
</section>
<section>
<section id="slide-org49bdac0">
<h2 id="org49bdac0">What's cascade?</h2>
<ul>
<li><p>
Set of rules for resolving conflicts with multiple CSS rules applied to the same elements
</p>

<div class="org-src-container">

<pre  class="src src-css"><span style="color: #A6E22E;">h1 </span>{
<span style="color: #FD971F;">color</span>: red; 
}
<span style="color: #A6E22E;">h1 </span>{
<span style="color: #FD971F;">color</span>: blue;
}
</pre>
</div></li>

</ul>


</section>
</section>
<section>
<section id="slide-orgce05505">
<h2 id="orgce05505">How's CSS applied ?</h2>
<ul>
<li class="fragment grow">Browser Stylesheets</li>
<li class="fragment grow">Linked ( External ) Stylesheets</li>
<li class="fragment grow">Embedded ( Internal ) Stylesheets</li>
<li class="fragment grow">Inline (Internal ) Stylesheets</li>

</ul>

</section>
</section>
<section>
<section id="slide-org89a968c" data-background="./images/css.jpg" data-background-size="700px" data-background-transition="slide">
<h2 id="org89a968c"></h2>

</section>
</section>
<section>
<section id="slide-orgfb19ba0">
<h2 id="orgfb19ba0">Selectors</h2>
<p>
Element Selectors 
</p>
<div class="org-src-container">

<pre  class="src src-html">&lt;<span style="color: #A6E22E;">p</span>&gt; Hello world &lt;/<span style="color: #A6E22E;">p</span>&gt;
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-css"><span style="color: #A6E22E;">p </span>{ <span style="color: #FD971F;">color</span>: red; }
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgf423065">
<h2 id="orgf423065">Selectors</h2>
<p>
Class selectors 
</p>
<div class="org-src-container">

<pre  class="src src-html">&lt;<span style="color: #A6E22E;">h1</span> <span style="color: #FD971F;">class</span>=<span style="color: #E6DB74;">"heading"</span>&gt;<span style="font-weight: bold; text-decoration: underline;"> Hello world </span>&lt;/<span style="color: #A6E22E;">h1</span>&gt;
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-css"><span style="color: #A6E22E;">.heading </span>{ <span style="color: #FD971F;">color</span>: red; }
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgde4e883">
<h2 id="orgde4e883">Selectors</h2>
<p>
Id selectors 
</p>
<div class="org-src-container">

<pre  class="src src-html">&lt;<span style="color: #A6E22E;">h1</span> <span style="color: #FD971F;">id</span>=<span style="color: #E6DB74;">"heading"</span>&gt;<span style="font-weight: bold; text-decoration: underline;"> Hello world </span>&lt;/<span style="color: #A6E22E;">h1</span>&gt;
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-css"><span style="color: #A6E22E;">#heading </span>{ <span style="color: #FD971F;">color</span>: red; }
</pre>
</div>


</section>
</section>
<section>
<section id="slide-org0b88081" data-background="./images/idvsclass.jpg" data-background-size="700px" data-background-transition="slide">
<h2 id="org0b88081">Unique vs non-unique</h2>
</section>
</section>
</div>
</div>
nil
<script src="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/lib/js/head.min.js"></script>
<script src="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
